tap "databricks/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "mutagen-io/mutagen"
tap "thecasualcoder/stable"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Text processing scripting language
brew "awk"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Utility to simplify running applications in docker containers
brew "dockerize"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line interface for JFrog products
brew "jfrog-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Easy building and installing of Erlang/OTP instances
brew "kerl"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Text-to-HTML conversion tool
brew "markdown"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Show ps output as a tree
brew "pstree"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Python interface to Tcl/Tk
brew "python-tk@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tracks most-used directories to make cd smarter
brew "z"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Vault
brew "hashicorp/tap/vault"
# Fast file synchronization and network forwarding for remote development
brew "mutagen-io/mutagen/mutagen"
# Compose with Mutagen integration
brew "mutagen-io/mutagen/mutagen-compose"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
npm "corepack"
